wrk/output/stage_6/5_range_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 8.304ms, rate sampling interval: 29ms
  Thread calibration: mean lat.: 746.643ms, rate sampling interval: 3309ms
  Thread calibration: mean lat.: 6.845ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 722.031ms, rate sampling interval: 3196ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.36s     1.51s    4.18s    76.24%
    Req/Sec   253.88     40.42   357.00     63.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.19ms
 75.000%    2.80s 
 90.000%    3.56s 
 99.000%    4.07s 
 99.900%    4.17s 
 99.990%    4.18s 
 99.999%    4.18s 
100.000%    4.18s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.305     0.000000            1         1.00
       1.470     0.100000         1887         1.11
       2.867     0.200000         3770         1.25
       4.755     0.300000         5658         1.43
       5.771     0.400000         7539         1.67
       8.187     0.500000         9426         2.00
    1806.335     0.550000        10367         2.22
    2063.359     0.600000        11308         2.50
    2297.855     0.650000        12253         2.86
    2541.567     0.700000        13194         3.33
    2803.711     0.750000        14134         4.00
    2936.831     0.775000        14611         4.44
    3076.095     0.800000        15084         5.00
    3201.023     0.825000        15553         5.71
    3317.759     0.850000        16021         6.67
    3450.879     0.875000        16493         8.00
    3508.223     0.887500        16728         8.89
    3563.519     0.900000        16965        10.00
    3620.863     0.912500        17197        11.43
    3674.111     0.925000        17436        13.33
    3745.791     0.937500        17674        16.00
    3774.463     0.943750        17787        17.78
    3809.279     0.950000        17908        20.00
    3833.855     0.956250        18030        22.86
    3866.623     0.962500        18143        26.67
    3895.295     0.968750        18269        32.00
    3913.727     0.971875        18315        35.56
    3946.495     0.975000        18374        40.00
    3966.975     0.978125        18434        45.71
    3995.647     0.981250        18496        53.33
    4024.319     0.984375        18553        64.00
    4032.511     0.985938        18580        71.11
    4040.703     0.987500        18611        80.00
    4057.087     0.989062        18639        91.43
    4075.519     0.990625        18670       106.67
    4095.999     0.992188        18702       128.00
    4104.191     0.992969        18715       142.22
    4118.527     0.993750        18731       160.00
    4126.719     0.994531        18742       182.86
    4136.959     0.995313        18759       213.33
    4143.103     0.996094        18772       256.00
    4147.199     0.996484        18781       284.44
    4149.247     0.996875        18787       320.00
    4153.343     0.997266        18798       365.71
    4157.439     0.997656        18804       426.67
    4161.535     0.998047        18811       512.00
    4163.583     0.998242        18813       568.89
    4165.631     0.998437        18818       640.00
    4167.679     0.998633        18821       731.43
    4169.727     0.998828        18824       853.33
    4173.823     0.999023        18830      1024.00
    4173.823     0.999121        18830      1137.78
    4175.871     0.999219        18835      1280.00
    4175.871     0.999316        18835      1462.86
    4175.871     0.999414        18835      1706.67
    4177.919     0.999512        18840      2048.00
    4177.919     0.999561        18840      2275.56
    4177.919     0.999609        18840      2560.00
    4177.919     0.999658        18840      2925.71
    4177.919     0.999707        18840      3413.33
    4179.967     0.999756        18841      4096.00
    4179.967     0.999780        18841      4551.11
    4182.015     0.999805        18843      5120.00
    4182.015     0.999829        18843      5851.43
    4182.015     0.999854        18843      6826.67
    4182.015     0.999878        18843      8192.00
    4182.015     0.999890        18843      9102.22
    4184.063     0.999902        18845     10240.00
    4184.063     1.000000        18845          inf
#[Mean    =     1357.538, StdDeviation   =     1513.755]
#[Max     =     4182.016, Total count    =        18845]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  27985 requests in 30.00s, 1.39MB read
Requests/sec:    932.69
Transfer/sec:     47.36KB