wrk/output/stage_6/5_range_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 2172.797ms, rate sampling interval: 6045ms
  Thread calibration: mean lat.: 2040.095ms, rate sampling interval: 5599ms
  Thread calibration: mean lat.: 187.521ms, rate sampling interval: 1294ms
  Thread calibration: mean lat.: 115.160ms, rate sampling interval: 724ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.98s     2.13s    5.15s    76.17%
    Req/Sec   246.06     12.71   283.00     77.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   25.81ms
 75.000%    3.93s 
 90.000%    4.96s 
 99.000%    5.14s 
 99.900%    5.15s 
 99.990%    5.15s 
 99.999%    5.15s 
100.000%    5.15s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.237     0.000000            1         1.00
       1.464     0.100000         1900         1.11
       3.379     0.200000         3803         1.25
       5.191     0.300000         5700         1.43
       7.807     0.400000         7604         1.67
      25.807     0.500000         9499         2.00
    3106.815     0.550000        10451         2.22
    3354.623     0.600000        11417         2.50
    3459.071     0.650000        12353         2.86
    3743.743     0.700000        13317         3.33
    3934.207     0.750000        14251         4.00
    4169.727     0.775000        14728         4.44
    4415.487     0.800000        15207         5.00
    4714.495     0.825000        15674         5.71
    4878.335     0.850000        16173         6.67
    4939.775     0.875000        16665         8.00
    4952.063     0.887500        16921         8.89
    4964.351     0.900000        17162        10.00
    4988.927     0.912500        17372        11.43
    5038.079     0.925000        17633        13.33
    5058.559     0.937500        17834        16.00
    5070.847     0.943750        17957        17.78
    5074.943     0.950000        18068        20.00
    5083.135     0.956250        18230        22.86
    5087.231     0.962500        18288        26.67
    5095.423     0.968750        18409        32.00
    5103.615     0.971875        18505        35.56
    5107.711     0.975000        18548        40.00
    5111.807     0.978125        18603        45.71
    5115.903     0.981250        18671        53.33
    5124.095     0.984375        18729        64.00
    5128.191     0.985938        18759        71.11
    5132.287     0.987500        18783        80.00
    5136.383     0.989062        18812        91.43
    5140.479     0.990625        18860       106.67
    5140.479     0.992188        18860       128.00
    5144.575     0.992969        18925       142.22
    5144.575     0.993750        18925       160.00
    5144.575     0.994531        18925       182.86
    5144.575     0.995313        18925       213.33
    5144.575     0.996094        18925       256.00
    5148.671     0.996484        18963       284.44
    5148.671     0.996875        18963       320.00
    5148.671     0.997266        18963       365.71
    5148.671     0.997656        18963       426.67
    5148.671     0.998047        18963       512.00
    5152.767     0.998242        18998       568.89
    5152.767     1.000000        18998          inf
#[Mean    =     1976.343, StdDeviation   =     2132.686]
#[Max     =     5148.672, Total count    =        18998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  27506 requests in 30.00s, 1.36MB read
Requests/sec:    916.90
Transfer/sec:     46.56KB